## Import library

In [61]:
from sqlalchemy import create_engine
import pandas as pd

## Buat cursor/engine

In [64]:
engine=create_engine('mysql+mysqlconnector://root:passw*@localhost/world')

## Ada berapa negara di data world?

In [6]:
query= '''
select count(name) as jumlah_negara from country;
'''
pd.read_sql_query(query,engine)

   jumlah_negara
0            239

## Tampilkan rata-rata harapan hidup berdasarkan benua

In [32]:
query= '''
select continent, avg(lifeexpectancy) as average_life_expectancy
from country
group by continent;
'''
pd.read_sql_query(query,engine)

       continent  average_life_expectancy
0  North America                 72.99189
1           Asia                 67.44118
2         Africa                 52.57193
3         Europe                 75.14773
4  South America                 70.94615
5        Oceania                 69.71500
6     Antarctica                      NaN

## Tampilkan Jumlah region di masing-masing benua

In [25]:
query= '''
select continent, count(distinct(region)) as jumlah_region from country
group by continent;
'''
pd.read_sql_query(query,engine)

       continent  jumlah_region
0           Asia              4
1         Europe              6
2  North America              3
3         Africa              5
4        Oceania              5
5     Antarctica              1
6  South America              1

## Tampilkan rata-rata GNP di Afrika berdasarkan regionnya

In [31]:
query= '''
select region, round(avg(GNP),2) as average_GNP from country
where continent='Africa'
group by region
'''
pd.read_sql_query(query,engine)

            region  average_GNP
0   Central Africa      3659.78
1   Eastern Africa      3496.25
2   Western Africa      6277.12
3  Southern Africa     25386.20
4  Northern Africa     34838.57

## Tampilkan negara di Eropa yang memiliki nama dimulai dari huruf I

In [22]:
query= '''
select name as Negara from country
where continent='Europe' and name like 'I%';
'''
pd.read_sql_query(query,engine)

    Negara
0  Ireland
1  Iceland
2    Italy

## Ada berapa bahasa unik di dunia?

In [29]:
query= '''
select count(distinct (language)) as jumlah_bahasa from countrylanguage;
'''
pd.read_sql_query(query,engine)

   jumlah_bahasa
0            457

## Tampilkan 10 negara dengan GNP di atas rata-rata GNP negara-negara di benua Oceania, diurutkan dari yang terbesar

In [67]:
query= '''
select name as negara, GNP from country
where GNP > (select avg(GNP) from country
group by continent
having continent='Oceania')
order by GNP desc
limit 10;
'''
pd.read_sql_query(query,engine)

           negara        GNP
0   United States  8510700.0
1           Japan  3787042.0
2         Germany  2133367.0
3          France  1424285.0
4  United Kingdom  1378330.0
5           Italy  1161755.0
6           China   982268.0
7          Brazil   776739.0
8          Canada   598862.0
9           Spain   553233.0

## Tampikan GNP negara belanda, ibukota beserta populasi dari ibukotanya

In [41]:
query= '''
select country.name as Country, 
country.GNP, 
city.name as Capital,
city.population
from country, city 
where country.capital = city.id
and country.name='Netherlands'
limit 10;
'''
pd.read_sql_query(query,engine)

       Country       GNP    Capital  population
0  Netherlands  371362.0  Amsterdam      731200

## 10 negara mana yang memiliki persentase pemakai bahasa spanyol paling tinggi

In [49]:
query= '''
select country.name as negara, countrylanguage.percentage as persentase 
from country, countrylanguage
where country.code = countrylanguage. countrycode
and countrylanguage.language='Spanish'
order by persentase desc
limit 10;
'''
pd.read_sql_query(query,engine)

               negara  persentase
0                Cuba       100.0
1         El Salvador       100.0
2            Colombia        99.0
3  Dominican Republic        98.0
4           Nicaragua        97.6
5          Costa Rica        97.5
6            Honduras        97.2
7           Venezuela        96.9
8           Argentina        96.8
9             Uruguay        95.7

## Tampikan GNP negara Indonesia, ibukota, populasi dari ibukotanya dan bahasa resmi yang dipakai

In [60]:
query= '''
select country.name as negara, city.name as ibukota, 
city.population as populasi, countrylanguage.language as bahasa 
from countrylanguage join country on countrylanguage.countrycode=country.code
join city on country.capital=city.id
where country.name='Indonesia' and countrylanguage.isofficial='T';
'''

pd.read_sql_query(query,engine)

      negara  ibukota  populasi bahasa
0  Indonesia  Jakarta   9604900  Malay